app/controllers/api/actors_controller.rb

    def index
      render json: Actors.all, each_serializer: ActorsSerializer
---
SELECT "actors".* FROM "actors"

    def create
      @actor = Actor.new(actor_params)

      if @actor.save
---
INSERT INTO "actors" ("name", "birthdate", "city_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", nil], ["birthdate", nil], ["city_of_birth", nil], ["created_at", "2022-12-05 22:05:38.365619"], ["updated_at", "2022-12-05 22:05:38.365619"]]