app/controllers/api/directors_controller.rb

   def create
     @director = Director.new(director_params)
       if @director.save
---
INSERT INTO "directors" ("name", "birthdate", "city_of_birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jhon Doe2"], ["birthdate", "2022-10-02"], ["city_of_birth", "Denver"], ["created_at", "2022-12-07 22:57:30.895540"], ["updated_at", "2022-12-07 22:57:30.895540"]]