app/controllers/api/movies_controller.rb

INSERT INTO "movies" ("name", "gender", "premiere_date", "cities", "budget", "director_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @movie = Movie.new(movie_params)
      if @movie.save